In [3]:
import pandas as pd
import numpy as np

string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data
string_data.isnull()
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [6]:
from numpy import nan as NA
data = pd.Series([1, NA, 3.5, NA, 7])
data.dropna()
#------ 等价于 --------
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [8]:
data = pd.DataFrame([[1, 6.5, 3], [1, NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])
cleaned = data.dropna()
data
cleaned

     0    1    2
0  1.0  6.5  3.0

In [10]:
data.dropna(how='all')
data[4] = NA

In [12]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [15]:
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df
df.dropna(thresh=2)

          0         1         2
2 -0.154768       NaN -1.035602
3  0.167428       NaN -0.412354
4  0.112831  0.146438 -0.059741
5  0.843899 -1.037159  0.656926
6  0.648267 -0.279176 -0.045127

In [16]:
#---- 填充缺失值 ---------
df.fillna(0)
df.fillna({1:0.5, 2:0})
#---- 就地修改 --------
_ = df.fillna(0, inplace=True)
df

          0         1         2
0  1.627253  0.000000  0.000000
1  0.110678  0.000000  0.000000
2 -0.154768  0.000000 -1.035602
3  0.167428  0.000000 -0.412354
4  0.112831  0.146438 -0.059741
5  0.843899 -1.037159  0.656926
6  0.648267 -0.279176 -0.045127

In [18]:
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df

          0         1         2
0  1.073002  0.532795 -0.262093
1 -0.896452  0.568745  1.264635
2 -0.877809       NaN  1.076615
3 -1.335674       NaN  0.469537
4 -0.656209       NaN       NaN
5  0.776906       NaN       NaN

In [20]:
df.fillna(method='ffill')
# -------- limit2 只填充2行 --------
df.fillna(method='ffill', limit=2)
#------- 填充平均值 ---------
data = pd.Series([1, NA, 3.5, NA, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [22]:
data = pd.DataFrame({'k1':['one', 'two']*3+['two'],
                     'k2':[1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [25]:
data.duplicated()
#--------- 删除重复的选项 ----------
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [26]:
data['v1'] = range(7)
#----- 根据时序的index来判断的 ---------
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [27]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [30]:
data = pd.DataFrame({'food':['bacon', 'pulled pork','bacon',
                             'Pastrami', 'corned beef','Bacon',
                             'pastrami',  'honey ham',
                             'novalox'],
                     'ounces':[4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8      novalox     6.0

In [37]:
#------- 对应关系 ---------
meat_to_animal = {
    'bacon':'pig',
    'pulled pork':'pig',
    'pastrami':'cow',
    'corned beef':'cow',
    'honey ham':'pig',
    'novalox':'salmon'
}
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8        novalox
Name: food, dtype: object

In [35]:
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces animal
0        bacon     4.0    pig
1  pulled pork     3.0    pig
2        bacon    12.0    pig
3     Pastrami     6.0    cow
4  corned beef     7.5    cow
5        Bacon     8.0    pig
6     pastrami     3.0    cow
7    honey ham     5.0    pig
8      novalox     6.0    NaN

In [39]:
#data['food'].map(lambda x:meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [41]:
data = pd.Series([1, -999, 2, -999, -1000, 3])
data
data.replace(-999, np.nan)
#------- 替换多个值 ---------
data.replace([-999, -1000], np.nan)
#------ 有不同的替换值 --------
data.replace([-999, -1000], [np.nan, 0])
#----- 也可以传入字典 ---------
data.replace({-999:np.nan, -1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [42]:
#------- 轴索引需要修改 ---------
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                   index=['Ohio', 'Colorado', 'New York'],
                   columns=['one', 'two', 'three', 'four'])
transform = lambda x:x[:4].upper()
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [43]:
#------------ 将其值赋值给index ----------
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [45]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [46]:
data.rename(index={'OHIO':'INDIANA'}, inplace=True)
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

In [50]:
#-------- 为了变于分析 常进行离散化 ------------
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins)
cats
#------- 返回的一个特殊的Categorical对象 ----------
cats.codes
cats.categories
#------ 统计一个总数 --------
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [52]:
#--------- 区间区分 ---------
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

#-------- 加入labels ---------
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(ages, bins, labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [54]:
data = np.random.rand(20)
#------ 均匀分布 ----------
pd.cut(data, 4, precision=2)
#------- 均匀分布qcut ----------
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1])

[(0.601, 0.948], (0.288, 0.601], (0.601, 0.948], (0.288, 0.601], (0.601, 0.948], ..., (0.601, 0.948], (0.948, 0.963], (0.112, 0.288], (0.948, 0.963], (0.288, 0.601]]
Length: 20
Categories (4, interval[float64]): [(0.112, 0.288] < (0.288, 0.601] < (0.601, 0.948] < (0.948, 0.963]]

In [57]:
# outlier 检查和过滤异常值
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()
#--------- 假设要找到某列中绝对值大小超过3 -------
col = data[2]
col[np.abs(col) > 3]
#---- 找出所有 ---------
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
109  0.344822 -3.004640  0.712070  0.346459
152 -0.389575  0.216250  0.161467 -3.197220
251  1.222256 -0.720677 -3.304015 -0.046468
345 -0.922885 -0.906157  0.806536 -3.415684
381  3.855873  0.614173 -1.366010 -1.073558
459 -0.572119  3.145275  0.016466  1.240963
527  3.165633  1.530152  1.148794 -0.805362
530  3.008132  0.512219 -1.279073 -1.013814
664 -3.688618 -0.105820 -1.442030  0.868181
793  0.334898  3.060783  2.327405 -1.503194

In [58]:
#---------- 将值限制在区间-3到3之间 --------
data[np.abs(data) > 3] = np.sign(data)*3
data.describe()
#------ 根据正值还是负值 ------
np.sign(data).head()

     0    1    2    3
0  1.0 -1.0 -1.0  1.0
1  1.0 -1.0  1.0  1.0
2  1.0 -1.0  1.0  1.0
3 -1.0 -1.0 -1.0  1.0
4  1.0 -1.0  1.0 -1.0

In [60]:
df = pd.DataFrame(np.arange(5*4).reshape((5, 4)))
sampler = np.random.permutation(5)
sampler

array([4, 0, 3, 2, 1])

In [63]:
df
df.take(sampler)
df.sample(n=3)

    0   1   2   3
0   0   1   2   3
4  16  17  18  19
1   4   5   6   7

In [65]:
choices = pd.Series([5, 7, -1, 6, 4])
draws = choices.sample(n=10, replace=True)
draws

0    5
3    6
4    4
3    6
4    4
4    4
2   -1
2   -1
4    4
0    5
dtype: int64

In [67]:
#---------  计算哑变量 ----------
df = pd.DataFrame({
    'key':['b', 'b', 'a', 'c', 'a', 'b'],
    'data1':range(6)
})
pd.get_dummies(df['key'])
dummies = pd.get_dummies(df['key'], prefix='key')
df_with_dummies = df[['data1']].join(dummies)
df_with_dummies

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [2]:
import pandas as pd
import numpy as np
mnames = ['move_id', 'title', 'genres']
movies = pd.read_table('datasets/movielens/movies.dat',sep='::', header=None, names=mnames)
movies[:10]
#------ 要为每个genre添加指标变量就需要做一些数据规整操作 ---

C:\Users\wd\Anaconda3\lib\site-packages\ipykernel_launcher.py:4: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  after removing the cwd from sys.path.

   move_id                               title                        genres
0        1                    Toy Story (1995)   Animation|Children's|Comedy
1        2                      Jumanji (1995)  Adventure|Children's|Fantasy
2        3             Grumpier Old Men (1995)                Comedy|Romance
3        4            Waiting to Exhale (1995)                  Comedy|Drama
4        5  Father of the Bride Part II (1995)                        Comedy
5        6                         Heat (1995)         Action|Crime|Thriller
6        7                      Sabrina (1995)                Comedy|Romance
7        8                 Tom and Huck (1995)          Adventure|Children's
8        9                 Sudden Death (1995)                        Action
9       10                    GoldenEye (1995)     Action|Adventure|Thriller

In [4]:
all_genres = []
for x in movies.genres:
    all_genres.extend(x.split('|'))
genres = pd.unique(all_genres)
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [7]:
#--------- 生产一个哑变量 -------------
zero_matrix = np.zeros((len(movies), len(genres)))
dummies = pd.DataFrame(zero_matrix, columns=genres)
gen = movies.genres[0]
gen.split('|')
dummies.columns.get_indexer(gen.split('|'))
for i, gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices] = 1
movies_windic = movies.join(dummies.add_prefix('Genre_'))
movies_windic.iloc[0]

move_id                                        1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Animation                                1
Genre_Children's                               1
Genre_Comedy                                   1
Genre_Adventure                                0
Genre_Fantasy                                  0
Genre_Romance                                  0
Genre_Drama                                    0
Genre_Action                                   0
Genre_Crime                                    0
Genre_Thriller                                 0
Genre_Horror                                   0
Genre_Sci-Fi                                   0
Genre_Documentary                              0
Genre_War                                      0
Genre_Musical                                  0
Genre_Mystery                                  0
Genre_Film-Noir                                0
Genre_Western                                  0
Name: 0, dtype: object

In [8]:
#-------- 结合get_dummies和cut进行离散化 -----------
np.random.seed(12345)
values = np.random.rand(10)
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [10]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

In [14]:
val = 'a,b,  gudio'
val.split(',')
pieces = [x.strip() for x in val.split(',')]
pieces
first, second, third = pieces
first + '::' + second + '::' + third
'guido' in val
val.index(',')

1

In [16]:
val.index(',')
val.find(':')

-1

In [18]:
#-------- 采用正则表达式测试 --------
import re
text = "foo  bar\t baz \tqux"
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [20]:
#------ 也可以使用regex先编译一个对象 然后再执行 ---------
regex = re.compile('\s+')
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [21]:
#---- 如果只希望得到匹配的regex的所有模式 ----
regex.findall(text)

['  ', '\t ', ' \t']

In [23]:
text  = """Dave dave@google.com
           Steve steve@gmail.com
           Rob   rob@gmail.com
           Ryan  ryan@yahoo.com"""
#----- 识别邮箱地址 --------
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'
regex = re.compile(pattern, flags=re.IGNORECASE)
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [24]:
m = regex.search(text)
m
text[m.start():m.end()]

'dave@google.com'

In [26]:
print (regex.match(text))
print (regex.sub('READCTED', text))

None
Dave READCTED
           Steve READCTED
           Rob   READCTED
           Ryan  READCTED

In [28]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'
regex = re.compile(pattern, flags=re.IGNORECASE)
m = regex.match('wesm@bright.net')
m.groups()

('wesm', 'bright', 'net')

In [1]:
regex.findall(text)
#-------- 对应特殊符号 ----------
print (regex.sub(r'Username:\1, Domain:\2, Suffix:\3'))

NameError: name 'regex' is not defined

In [4]:
import pandas as pd
import numpy as np

def sex_judge(x):
    if x in ['Mr']:
      return 'male'
    elif x in ['Ms', 'Miss', 'Mrs']:
      return 'female'
    else:
      return 'oth'

test_data = {'name':['Ms', 'Mr', 'Miss', 'Mrs', 'Mr']}
df1 = pd.DataFrame(test_data)
#------- 都可以 -----------
df1['Sex'] = df1['name'].map(sex_judge)
df1.head()

   name     Sex
0    Ms  female
1    Mr    male
2  Miss  female
3   Mrs  female
4    Mr    male